# Задача 1
# expression = input('Введите выражение: ')
# if '+' in expression:
#     a, b = expression.split('+')
#     print(int(a) + int(b))
# elif '-' in expression:
#     a, b = expression.split('-')
#     print(int(a) - int(b))
# elif '*' in expression:
#     a, b = expression.split('*')
#     print(int(a) * int(b))
# elif '/' in expression:
#     a, b = expression.split('/')
#     print(int(a) / int(b))

# Задача 2
# import random
# numbers = [random.randrange(-100, 100) for i in range(5)]
# k = 0
# print ('Все элементы: ' +  str(numbers))
# print('Максимальный элемент: ', max(numbers))
# print('Минимальный элемент: ', min(numbers))
# print('Количество отрицательный элементов: ', sum(k < 0 for k in numbers))
# print('Количество положительных элементов: ', sum(k > 0 for k in numbers))
# print('Количество нулей: ', sum(k == 0 for k in numbers))
