# Задача 1
# a = str(input('Введите строку: '))
# b = a[::-1]
# if a == b:
#   print("Эта строка палиндромом")
# else:
#   print("Эта строка не палиндромом")

# Задача 2
# text = str(input("Введите текст: "))
# words = input("Введите зарезервированные слова: ")
# text = text.lower()
# words = words.split()
# for i in words:
#     text = text.replace(i.lower(), i.upper())
# print(text)

# Задача 3
# text = input('Введите текст: ')
# symbol = ['.', '?', '!']
# count = 0
# for index in symbol:
#     text.count(index)
#     count = count + text.count(index)
# print(count)

